package ru.spsuace.projects.travel_agency;

import java.util.Date;
/**
 * Создать систему, имулирующую работу туристического агенства.
 * 1) Есть клиенты, которые имеют заданный бюджет, максимальное количество дней отпуска и список желаемых городов
 * 2) Есть клиенты, которые имеют заданное количество человек и заданное направление с плавающими датами
 * 3) Есть турбазы, которые находятся в каком-то городе
 * 4) турбазы обращается в агенство и передает ему список путевок с заданными датами и ценами и количеством мест
 * 5) Клиент обращается в агенство и оставляет заявки на различные города, максимальный бюджет
 * и максимально возможные даты. Если доступные путевки есть, то клиент их сразу покупает
 * 6) Агентство накидывает на цены путевок заданный процент + уведомляет клиентов о появлении необходимых путевок
 * Процент меняется при покупек путевок оптом (от заданного количества человек)
 * 7) После покупки путевки, клиент отменяет заявки, которые уже не вписываются в бюджет, время отпуска или в его даты
 */
public class Camping {
    private String City;
    public void Tour(Date data, double price, int packages){


    }

}
